"==============List=============="
#списки - изменяемый, упорядоченный, итерируемый тип данных предназначенный для храненния данных в определенном порядке
string = 'hello'
new = string.upper() #'hello'

list_ = [1, 2, "jelaous", [0.5, 2], {"a":3}]
list_ = [2] #2
list_ = [4] # [0.5, 2]
list_ = [4][0] # 0.5
list_ = [3][0] # 'j'
list_ = [-1]["a"] #3

"==============Создание списков=============="
list1 = [1,2,3]
list2 = list('hello') # ['h', 'e', 'l', 'l', 'o']

"==============Методы=============="
#append - добавляет в конец списка, можно передать только один элемент
list1.append(["hello"]) #"hello"
list1.append(1) #"hello", 1

#count - считает количество принятого элемента в списке
list1 = [1,2,3,4,5,6,6]
list1.count(1) # 1
list1.count(6) # 2
len(list_) # 7

#extend - добавляет элементы второго списка(list2) в первый, изменяя первый(list1)
list1 = [ 1, 2, 3]
list2 = [ 3, 4, 5]
list1.extend(list2) # [1,2,3,4,5,6]

#index - возвращает индекс первого прохождения принятого элемента

#insert - добавляет элемент по индексу
list1 = [1,2,3]
list1.insert(0, "hello") # ["hello", 1, 2, 3]
list1.insert(8, 'kuka') # ["hello, 1, 2, 3, kuka"]

#pop - а
list1 = [1,2,3,4,5,6]
popped = list1.pop()
print(list1, popped) # [1,2,3,4,5] 6
popped = list1.pop(1)
print(list1, popped) # [1,3,4,5] 2